; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v4)
             (pred_4 ?v2 ?v6)
             (pred_10 ?v5 ?v6)
             (pred_11 ?v11 ?v5 )
	     (pred_6 ?v5)
             (pred_1 ?v9)
             (pred_2 ?v2)
             (pred_3 ?v6)
             (pred_8 ?v5)
             (pred_5 ?v2)
             (pred_9 ?v5)
             (pred_12 ))



(:action op_3
:parameters (?v1 ?v8 ?v3 ?v10)
:precondition (and (pred_1 ?v1) (pred_1 ?v8) (pred_2 ?v3) (pred_3 ?v10)
          (pred_7 ?v1 ?v8) (pred_4 ?v3 ?v10)
                   (pred_10 ?v8 ?v10) (pred_6 ?v1) 
                   (pred_8 ?v8) (pred_5 ?v3))
:effect (and  (pred_9 ?v8) (not (pred_8 ?v8))))


(:action op_1
:parameters (?v1 ?v7)
:precondition (and (pred_1 ?v1) (pred_1 ?v7)
               (pred_6 ?v1) (pred_7 ?v1 ?v7) (pred_9 ?v7))
:effect (and (pred_6 ?v7) (not (pred_6 ?v1))))

(:action op_2
:parameters (?v1 ?v3)
:precondition (and (pred_1 ?v1) (pred_2 ?v3) 
                  (pred_6 ?v1) (pred_11 ?v3 ?v1) (pred_12 ))
:effect (and (pred_5 ?v3)
   (not (pred_11 ?v3 ?v1)) (not (pred_12 ))))


(:action op_5
:parameters (?v1 ?v12 ?v13)
:precondition (and (pred_1 ?v1) (pred_2 ?v12) (pred_2 ?v13)
                  (pred_6 ?v1) (pred_5 ?v13) (pred_11 ?v12 ?v1))
:effect (and (pred_5 ?v12) (pred_11 ?v13 ?v1)
        (not (pred_5 ?v13)) (not (pred_11 ?v12 ?v1))))

(:action op_4
:parameters (?v1 ?v3)
:precondition (and (pred_1 ?v1) (pred_2 ?v3) 
                  (pred_6 ?v1) (pred_5 ?v3))
:effect (and (pred_12 ) (pred_11 ?v3 ?v1) (not (pred_5 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_15 obj_31 obj_05 obj_27 obj_32 obj_01 obj_20 obj_23 obj_04 obj_06 obj_12 obj_21 obj_07 obj_17 obj_13 obj_22 obj_28 obj_02 obj_03 obj_24 obj_26 obj_16 obj_29 obj_25 obj_30
    obj_08 obj_11 obj_10
    obj_09 obj_18 obj_14 obj_19
    )

    (:init
       (pred_12)

       (pred_1 obj_15)
       (pred_1 obj_31)
       (pred_1 obj_05)
       (pred_1 obj_27)
       (pred_1 obj_32)
       (pred_1 obj_01)
       (pred_1 obj_20)
       (pred_1 obj_23)
       (pred_1 obj_04)
       (pred_1 obj_06)
       (pred_1 obj_12)
       (pred_1 obj_21)
       (pred_1 obj_07)
       (pred_1 obj_17)
       (pred_1 obj_13)
       (pred_1 obj_22)
       (pred_1 obj_28)
       (pred_1 obj_02)
       (pred_1 obj_03)
       (pred_1 obj_24)
       (pred_1 obj_26)
       (pred_1 obj_16)
       (pred_1 obj_29)
       (pred_1 obj_25)
       (pred_1 obj_30)
       (pred_3 obj_08)
       (pred_3 obj_11)
       (pred_3 obj_10)
       (pred_2 obj_09)
       (pred_2 obj_18)
       (pred_2 obj_14)
       (pred_2 obj_19)

       (pred_7 obj_15 obj_01)
       (pred_7 obj_15 obj_31)
       (pred_7 obj_31 obj_20)
       (pred_7 obj_31 obj_05)
       (pred_7 obj_31 obj_15)
       (pred_7 obj_05 obj_23)
       (pred_7 obj_05 obj_27)
       (pred_7 obj_05 obj_31)
       (pred_7 obj_27 obj_04)
       (pred_7 obj_27 obj_32)
       (pred_7 obj_27 obj_05)
       (pred_7 obj_32 obj_06)
       (pred_7 obj_32 obj_27)
       (pred_7 obj_01 obj_12)
       (pred_7 obj_01 obj_20)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_20 obj_21)
       (pred_7 obj_20 obj_23)
       (pred_7 obj_20 obj_31)
       (pred_7 obj_20 obj_01)
       (pred_7 obj_23 obj_07)
       (pred_7 obj_23 obj_04)
       (pred_7 obj_23 obj_05)
       (pred_7 obj_23 obj_20)
       (pred_7 obj_04 obj_17)
       (pred_7 obj_04 obj_06)
       (pred_7 obj_04 obj_27)
       (pred_7 obj_04 obj_23)
       (pred_7 obj_06 obj_13)
       (pred_7 obj_06 obj_32)
       (pred_7 obj_06 obj_04)
       (pred_7 obj_12 obj_22)
       (pred_7 obj_12 obj_21)
       (pred_7 obj_12 obj_01)
       (pred_7 obj_21 obj_28)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_21 obj_20)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_07 obj_23)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_17 obj_13)
       (pred_7 obj_17 obj_04)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_13 obj_24)
       (pred_7 obj_13 obj_06)
       (pred_7 obj_13 obj_17)
       (pred_7 obj_22 obj_26)
       (pred_7 obj_22 obj_28)
       (pred_7 obj_22 obj_12)
       (pred_7 obj_28 obj_16)
       (pred_7 obj_28 obj_02)
       (pred_7 obj_28 obj_21)
       (pred_7 obj_28 obj_22)
       (pred_7 obj_02 obj_29)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_02 obj_28)
       (pred_7 obj_03 obj_25)
       (pred_7 obj_03 obj_24)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_24 obj_30)
       (pred_7 obj_24 obj_13)
       (pred_7 obj_24 obj_03)
       (pred_7 obj_26 obj_16)
       (pred_7 obj_26 obj_22)
       (pred_7 obj_16 obj_29)
       (pred_7 obj_16 obj_28)
       (pred_7 obj_16 obj_26)
       (pred_7 obj_29 obj_25)
       (pred_7 obj_29 obj_02)
       (pred_7 obj_29 obj_16)
       (pred_7 obj_25 obj_30)
       (pred_7 obj_25 obj_03)
       (pred_7 obj_25 obj_29)
       (pred_7 obj_30 obj_24)
       (pred_7 obj_30 obj_25)
       (pred_8 obj_21)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_32)
       (pred_10  obj_21 obj_08)
       (pred_10  obj_12 obj_11)
       (pred_10  obj_15 obj_10)
       (pred_10  obj_32 obj_10)
       (pred_9 obj_31)
       (pred_9 obj_05)
       (pred_9 obj_27)
       (pred_9 obj_01)
       (pred_9 obj_20)
       (pred_9 obj_23)
       (pred_9 obj_04)
       (pred_9 obj_06)
       (pred_9 obj_07)
       (pred_9 obj_17)
       (pred_9 obj_13)
       (pred_9 obj_22)
       (pred_9 obj_28)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_9 obj_24)
       (pred_9 obj_26)
       (pred_9 obj_16)
       (pred_9 obj_29)
       (pred_9 obj_25)
       (pred_9 obj_30)

       (pred_4  obj_09 obj_08)
       (pred_4  obj_18 obj_11)
       (pred_4  obj_14 obj_10)
       (pred_4  obj_19 obj_11)
       (pred_11 obj_09 obj_30)
       (pred_11 obj_18 obj_28)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_19 obj_17)
       (pred_6 obj_17)
    )

    (:goal (and
       (pred_11 obj_18 obj_20)
       (pred_11 obj_19 obj_28)
    ))
(:constraints
  (always (not (pred_6 obj_07)))
)
)

; plan
1. (op_2 obj_17 obj_19)
   deleted: (pred_11 obj_19 obj_17) (pred_12)
   added: (pred_5 obj_19)
   goals met: 0 of 2
2. (op_1 obj_17 obj_04)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_04)
   goals met: 0 of 2
3. (op_1 obj_04 obj_23)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_23)
   goals met: 0 of 2
4. (op_1 obj_23 obj_20)
   deleted: (pred_6 obj_23)
   added: (pred_6 obj_20)
   goals met: 0 of 2
5. (op_1 obj_20 obj_01)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_01)
   goals met: 0 of 2
6. (op_3 obj_01 obj_12 obj_19 obj_11)
   deleted: (pred_8 obj_12)
   added: (pred_9 obj_12)
   goals met: 0 of 2
7. (op_5 obj_01 obj_14 obj_19)
   deleted: (pred_5 obj_19) (pred_11 obj_14 obj_01)
   added: (pred_5 obj_14) (pred_11 obj_19 obj_01)
   goals met: 0 of 2
8. (op_1 obj_01 obj_20)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_20)
   goals met: 0 of 2
9. (op_4 obj_20 obj_14)
   deleted: (pred_5 obj_14)
   added: (pred_12) (pred_11 obj_14 obj_20)
   goals met: 0 of 2
10. (op_1 obj_20 obj_01)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_01)
   goals met: 0 of 2
11. (op_2 obj_01 obj_19)
   deleted: (pred_11 obj_19 obj_01) (pred_12)
   added: (pred_5 obj_19)
   goals met: 0 of 2
12. (op_1 obj_01 obj_12)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_12)
   goals met: 0 of 2
13. (op_1 obj_12 obj_22)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_22)
   goals met: 0 of 2
14. (op_1 obj_22 obj_28)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_28)
   goals met: 0 of 2
15. (op_5 obj_28 obj_18 obj_19)
   deleted: (pred_5 obj_19) (pred_11 obj_18 obj_28)
   added: (pred_5 obj_18) (pred_11 obj_19 obj_28)
   goals met: 1 of 2
16. (op_1 obj_28 obj_22)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_22)
   goals met: 1 of 2
17. (op_1 obj_22 obj_12)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_12)
   goals met: 1 of 2
18. (op_1 obj_12 obj_01)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_01)
   goals met: 1 of 2
19. (op_1 obj_01 obj_20)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_20)
   goals met: 1 of 2
20. (op_5 obj_20 obj_14 obj_18)
   deleted: (pred_5 obj_18) (pred_11 obj_14 obj_20)
   added: (pred_5 obj_14) (pred_11 obj_18 obj_20)
   goals met: 2 of 2
